# 7. Реализовать генератор с помощью функции с ключевым словом yield, создающим очередное значение.
# При вызове функции должен создаваться объект-генератор. Функция вызывается следующим образом: for el in fact(n).
#     Она отвечает за получение факториала числа. В цикле нужно выводить только первые n чисел, начиная с 1! и до n!.
# Подсказка: факториал числа n — произведение чисел от 1 до n. Например, факториал четырёх 4! = 1 * 2 * 3 * 4 = 24.
def fact(n): # функция нахождения факториала числа с yield вместо return
    a = 1
    for i in range(1, n+1):
        a *= i
        yield a
n = 15
for ind, el in enumerate(fact(n)): #т.к. индекс с 0, нужно в выводе на экран +1
    print(f'Факториал числа  {ind+1} равен {el}')
