# 2. Представлен список чисел. Необходимо вывести элементы исходного списка, значения которых больше предыдущего
# элемента.
# Подсказка: элементы, удовлетворяющие условию, оформить в виде списка. Для его формирования используйте генератор.
# Пример исходного списка: [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55].
# Результат: [12, 44, 4, 10, 78, 123].
my_list = [250, 125, 1, 5, 36, 2, 11, 3, 2, 159, 12547, 1256987]
print(my_list)
new_list = [my_list[el+1] for el in range(0, len(my_list)-1, 1) if my_list[el+1] > my_list[el]]
print(new_list)
